{"id":"ec24f169-3a4f-45f8-b471-34938c09fd4e","updated_at":"2026-04-23T15:14:07.153Z","updated_by":"elastic","created_at":"2026-04-23T13:34:03.897Z","created_by":"elastic","name":"New User Account Created","tags":[],"interval":"1m","enabled":true,"revision":2,"description":"Detects creation of new user accounts — MITRE T1136.001","risk_score":65,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://10.10.1.128:5601/app/security"},"author":[],"false_positives":[],"from":"now-2m","rule_id":"184dc04b-3f8e-42fe-bdfe-c7500534fb57","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[{"id":"T1136","name":"Create Account","reference":"https://attack.mitre.org/techniques/T1136/","subtechnique":[]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["logs-system.auth-*"],"query":"event.dataset: system.auth and message: *useradd* or message: *new user*","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
