{"id":"2d878fcd-b628-4861-9f4d-c1bc35590b6c","updated_at":"2026-04-23T14:58:11.428Z","updated_by":"elastic","created_at":"2026-04-23T13:28:03.487Z","created_by":"elastic","name":"Port Scan Detection","tags":[],"interval":"1m","enabled":true,"revision":1,"description":"Detects port scanning activity — MITRE T1046","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://10.10.1.128:5601/app/security"},"author":[],"false_positives":[],"from":"now-6m","rule_id":"7aa24422-07c6-4483-be90-87d9ea136e2b","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0007","name":"Discovery","reference":"https://attack.mitre.org/tactics/TA0007/"},"technique":[{"id":"T1046","name":"Network Service Discovery","reference":"https://attack.mitre.org/techniques/T1046/","subtechnique":[]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["logs-system*"],"query":"event.dataset: system.syslog and message: *nmap*","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
