{"id":"f7974050-6358-4227-a065-43a0ac7f9115","updated_at":"2026-04-23T13:20:02.737Z","updated_by":"elastic","created_at":"2026-04-23T13:20:02.737Z","created_by":"elastic","name":"SSH Brute-Force Detection","tags":[],"interval":"1m","enabled":true,"revision":0,"description":"Detects multiple SSH login failures from the same IP — MITRE T1110.001","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://10.10.1.128:5601/app/security"},"author":[],"false_positives":[],"from":"now-6m","rule_id":"14c27a27-b52f-4fd0-b559-c2e269ce0dd4","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","index":["logs-system.auth-*"],"query":"event.dataset: system.auth and event.action: ssh_login and event.outcome: failure","filters":[],"threshold":{"field":["source.ip"],"value":5,"cardinality":[]},"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
