{"id":"ea4e8cc7-ee1e-49cf-a9dd-607caee344b3","updated_at":"2026-04-23T15:00:59.521Z","updated_by":"elastic","created_at":"2026-04-23T13:31:43.200Z","created_by":"elastic","name":"Suspicious Privilege Escalation - Sudo Failure","tags":[],"interval":"1m","enabled":true,"revision":1,"description":"Detects failed sudo attempts — MITRE T1548.003","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://10.10.1.128:5601/app/security"},"author":[],"false_positives":[],"from":"now-2m","rule_id":"17b0683b-e9ab-4206-bf92-b1e0332c214f","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0004","name":"Privilege Escalation","reference":"https://attack.mitre.org/tactics/TA0004/"},"technique":[{"id":"T1548","name":"Abuse Elevation Control Mechanism","reference":"https://attack.mitre.org/techniques/T1548/","subtechnique":[]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["logs-system.auth-*"],"query":"event.dataset: system.auth and message: *authentication failure*","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
