{"id":"c97f0593-a67a-4755-9935-9224cd053922","updated_at":"2026-04-23T13:37:44.812Z","updated_by":"elastic","created_at":"2026-04-23T13:37:44.812Z","created_by":"elastic","name":"Successful SSH Login - Monitor","tags":[],"interval":"1m","enabled":true,"revision":0,"description":"Monitors successful SSH logins for investigation — MITRE T1078","risk_score":21,"severity":"low","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://10.10.1.128:5601/app/security"},"author":[],"false_positives":[],"from":"now-2m","rule_id":"a8bbbd35-d640-473c-b192-f6c352d1ed46","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0001","name":"Initial Access","reference":"https://attack.mitre.org/tactics/TA0001/"},"technique":[{"id":"T1078","name":"Valid Accounts","reference":"https://attack.mitre.org/techniques/T1078/","subtechnique":[]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["logs-system.auth-*"],"query":"event.dataset: system.auth and event.action: ssh_login and event.outcome: success","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
